-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Май 30 2019 г., 11:33
-- Версия сервера: 10.1.38-MariaDB
-- Версия PHP: 7.3.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `db`
--

-- --------------------------------------------------------

--
-- Структура таблицы `sensors`
--

CREATE TABLE `sensors` (
  `Number` int(11) NOT NULL,
  `Id` int(11) DEFAULT NULL,
  `Value` int(11) DEFAULT NULL,
  `cdate` date NOT NULL,
  `UserId` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Дамп данных таблицы `sensors`
--

INSERT INTO `sensors` (`Number`, `Id`, `Value`, `cdate`, `UserId`) VALUES
(57, 1, 8, '2019-05-22', 1),
(58, 1, 7, '2019-05-22', 1),
(59, 1, 1, '2019-05-22', 1),
(60, 1, 11, '2019-05-22', 1),
(61, 1, 5, '2019-05-22', 1),
(62, 1, 7, '2019-05-22', 1),
(63, 1, 11, '2019-05-22', 1),
(64, 1, 10, '2019-05-22', 1),
(65, 1, 11, '2019-05-22', 1),
(66, 1, 11, '2019-05-22', 1),
(67, 1, 11, '2019-05-22', 1),
(68, 1, 10, '2019-05-22', 1),
(69, 1, 11, '2019-05-22', 1),
(70, 1, 10, '2019-05-22', 1),
(71, 1, 11, '2019-05-22', 1),
(72, 1, 11, '2019-05-22', 1),
(73, 1, 10, '2019-05-22', 1),
(74, 1, 16, '2019-05-22', 1),
(75, 1, 10, '2019-05-22', 1),
(76, 1, 11, '2019-05-22', 1),
(77, 1, 11, '2019-05-22', 1),
(78, 1, 5, '2019-05-22', 1),
(79, 1, 10, '2019-05-22', 1),
(80, 1, 11, '2019-05-22', 1),
(81, 1, 11, '2019-05-22', 1),
(82, 1, 10, '2019-05-22', 1),
(83, 1, 11, '2019-05-22', 1),
(84, 1, 11, '2019-05-22', 1),
(85, 1, 10, '2019-05-22', 1),
(86, 1, 11, '2019-05-22', 1),
(87, 1, 5, '2019-05-22', 1),
(88, 1, 8, '2019-05-22', 1),
(89, 1, 11, '2019-05-22', 1),
(90, 1, 10, '2019-05-22', 1),
(91, 1, 11, '2019-05-22', 1),
(92, 1, 11, '2019-05-22', 1),
(93, 1, 10, '2019-05-22', 1),
(94, 1, 11, '2019-05-22', 1),
(95, 1, 10, '2019-05-22', 1),
(96, 1, 10, '2019-05-22', 1),
(97, 1, 11, '2019-05-22', 1),
(98, 1, 5, '2019-05-22', 1),
(99, 1, 10, '2019-05-22', 1),
(100, 1, 11, '2019-05-22', 1),
(101, 1, 11, '2019-05-22', 1),
(102, 1, 10, '2019-05-22', 1),
(103, 1, 11, '2019-05-22', 1),
(104, 1, 2, '2019-05-24', 1),
(105, 1, 6, '2019-05-24', 1),
(106, 1, 7, '2019-05-24', 1),
(107, 1, 5, '2019-05-24', 1),
(108, 1, 1, '2019-05-24', 1),
(109, 1, 6, '2019-05-24', 1),
(110, 1, 4, '2019-05-24', 1),
(111, 1, 8, '2019-05-24', 1),
(112, 1, 1, '2019-05-24', 1),
(113, 1, 9, '2019-05-24', 1),
(114, 1, 1, '2019-05-24', 1),
(115, 1, 1, '2019-05-24', 1),
(116, 1, 7, '2019-05-24', 1),
(117, 1, 1, '2019-05-24', 1),
(118, 1, 4, '2019-05-24', 1),
(119, 1, 7, '2019-05-24', 1),
(120, 1, 3, '2019-05-24', 1),
(121, 1, 10, '2019-05-24', 1),
(122, 1, 10, '2019-05-24', 1),
(123, 1, 13, '2019-05-24', 1),
(124, 1, 11, '2019-05-24', 1),
(125, 1, 10, '2019-05-24', 1),
(126, 1, 11, '2019-05-24', 1),
(127, 1, 10, '2019-05-24', 1),
(128, 1, 11, '2019-05-24', 1),
(129, 1, 10, '2019-05-24', 1),
(130, 1, 10, '2019-05-24', 1),
(131, 1, 11, '2019-05-24', 1),
(132, 1, 10, '2019-05-24', 1),
(133, 1, 11, '2019-05-24', 1),
(134, 1, 10, '2019-05-24', 1),
(135, 1, 11, '2019-05-24', 1),
(136, 1, 10, '2019-05-24', 1),
(137, 1, 8, '2019-05-24', 1),
(138, 1, 5, '2019-05-24', 1),
(139, 1, 10, '2019-05-24', 1),
(140, 1, 5, '2019-05-24', 1),
(141, 1, 9, '2019-05-24', 1),
(142, 1, 11, '2019-05-24', 1),
(143, 1, 10, '2019-05-24', 1),
(144, 1, 10, '2019-05-24', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `UserId` int(11) NOT NULL,
  `username` varchar(50) COLLATE utf8_bin NOT NULL,
  `passcode` varchar(50) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`UserId`, `username`, `passcode`) VALUES
(1, '098f6bcd4621d373cade4e832627b4f6', '202cb962ac59075b964b07152d234b70'),
(2, 'ad0234829205b9033196ba818f7a872b', '202cb962ac59075b964b07152d234b70');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `sensors`
--
ALTER TABLE `sensors`
  ADD PRIMARY KEY (`Number`),
  ADD KEY `UserId` (`UserId`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`UserId`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `sensors`
--
ALTER TABLE `sensors`
  MODIFY `Number` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=145;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `UserId` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `sensors`
--
ALTER TABLE `sensors`
  ADD CONSTRAINT `sensors_ibfk_1` FOREIGN KEY (`UserId`) REFERENCES `users` (`UserId`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
